Revit 2024 API
Document.GetUnits Method
 Gets the Units object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Units GetUnits()
Visual Basic
Public Function GetUnits As Units
Visual C++
public:
Units^ GetUnits()
Return Value
 The Units object.
See Also
Document Class
Autodesk.Revit.DB Namespace